# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

print('Введите № четверти =  ', end='')
number=int(input())
if number == 1:
   print(f'{number} четверть: x∈(0;+∞), y∈(0;+∞)')
elif number == 2:
   print(f'{number} четверть: x∈(0;-∞), y∈(0;+∞)')
elif number == 3:
   print(f'{number} четверть: x∈(0;-∞), y∈(0;-∞)')
elif number == 4:
   print(f'{number} четверть: x∈(0;+∞), y∈(0;-∞)')
else:
    print('Введите номер четверти от 1 до 4')