# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

wd=[1,2,3,4,5]
print('Введите номер дня недели - ',end='') 
d=int(input())
print(d,end='')
if d:=wd:
    print(' -> нет')
else:
    print(' -> да')
 


